package com.poll.common;

import lombok.AllArgsConstructor;
import lombok.Getter;

public enum MsgCode {

	C00000000("00000000", "响应成功"),
	C00000001("00000001", "请求失败"),
	C00000002("00000002", "账号或密码错误"),
	C00000003("00000003", "验证码错误"),
	C00000004("00000004", "账号信息未匹配，请重试"),
	C00000011("00000011", "参数错误"),
	C00000012("00000012", "验签失败"),
	C00000015("00000015", "返回参数组装失败"),
	C00000016("00000016", "支撑服务响应失败"),
	C00000019("00000019", "请求太快了，请慢一点"),
	C00000020("00000020", "接口暂未开放"),
	C00000021("00000021", "请登录"),
	C00000022("00000022", "无访问权限"),
	C00000023("00000023", "配置错误"),
	C00000024("00000024", "未授权接入"),
	C00000025("00000025", "已停用"),
	C00000026("00000026", "暂不可用"),
	C00000261("00000261", "角色暂不可用"),
	C00000262("00000262", "接口暂不可用"),
	C00000028("00000028", "token已过期"),
	C00000281("00000281", "令牌生成失败"),
	C00000282("00000282", "令牌校验失败"),
	C00000283("00000283", "令牌已失效"),
	C00000030("00000030", "已达上限"),
	C00000040("00000040", "业务执行失败"),
	C00000404("00000404", "请求地址不存在"),
	C00000080("00000080", "账户异常"),
	C00000999("00000999", "未知错误"),



	;

	public final String code;
	public final String msg;

	private MsgCode(String code, String msg) {
		this.code = code;
		this.msg = msg;
	}

}
